---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
source: html/7e250cb2-63d0-aa26-5361-4f0a2a2b4a34.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType

A type element that represents a connection approval type.

## Syntax (C#)
```csharp
public class StructuralConnectionApprovalType : ElementType
```